tutorials/multiRegion/CHT/VoFcoolingCylinder2D/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;

    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
    grad(k)         $limited;
    grad(omega)     $limited;
}

divSchemes
{
    div(phi,alpha)      Gauss interfaceCompression vanLeer 1;

    div(rhoPhi,U)       Gauss linearUpwind limited;

    turbulence          Gauss limitedLinear 1;
    div(alphaRhoPhi,e)  $turbulence;
    div(alphaRhoPhi,T)  Gauss upwind;
    div(rhoPhi,K)       $turbulence;
    div(phi,p)          $turbulence;
    div(phi,k)          $turbulence;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
